In [1]:
import pandas as pd
import numpy as np

df = pd.read_csv("../datasets/employees.csv")

df.head()

   Name  Age  Salary Department
0  Amit   24   35000         HR
1  Riya   26   42000         IT
2  John   22   30000      Sales
3  Sara   25   40000         IT

In [2]:
df.tail

<bound method NDFrame.tail of    Name  Age  Salary Department
0  Amit   24   35000         HR
1  Riya   26   42000         IT
2  John   22   30000      Sales
3  Sara   25   40000         IT>

In [3]:
df.shape

(4, 4)

In [4]:
df.columns

Index(['Name', 'Age', 'Salary', 'Department'], dtype='str')

In [5]:
df.info

<bound method DataFrame.info of    Name  Age  Salary Department
0  Amit   24   35000         HR
1  Riya   26   42000         IT
2  John   22   30000      Sales
3  Sara   25   40000         IT>

In [6]:
df.describe

<bound method NDFrame.describe of    Name  Age  Salary Department
0  Amit   24   35000         HR
1  Riya   26   42000         IT
2  John   22   30000      Sales
3  Sara   25   40000         IT>

In [7]:
df.isnull().sum()

Name          0
Age           0
Salary        0
Department    0
dtype: int64

In [8]:
df.drop_duplicates(inplace=True)

In [9]:
df.dtypes

Name            str
Age           int64
Salary        int64
Department      str
dtype: object

In [10]:
df["Age"] = df["Age"].astype(int)
df["Salary"] = df["Salary"].astype(float)

In [11]:
df.dtypes

Name              str
Age             int64
Salary        float64
Department        str
dtype: object

In [12]:
df["Department"].value_counts() # count of each departments

Department
IT       2
HR       1
Sales    1
Name: count, dtype: int64

In [13]:
#basic Stats

print("Mean of Age:", df["Age"].mean())
print("Median of age:", df["Age"].median())
print("Max Salary:", df["Salary"].max())
print("Min Salary:", df["Salary"].min())
print("Mean of Salary:",df["Salary"].mean())

Mean of Age: 24.25
Median of age: 24.5
Max Salary: 42000.0
Min Salary: 30000.0
Mean of Salary: 36750.0

In [14]:
ages = df["Age"].to_numpy()
Salaries = df["Salary"].to_numpy()

print("Age STD", np.std(ages))
print("Salary STD:", np.std(Salaries))
print("Salary + 5000 bump: ", Salaries + 5000)

Age STD 1.479019945774904
Salary STD: 4656.9840025492895
Salary + 5000 bump:  [40000. 47000. 35000. 45000.]

In [15]:
df.to_csv('cleaned_employees.csv', index=False)